Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 996, Read Data and Bit Flip Register 27 */
#define MTU_MC9_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061996u)

/** \brief 998, Read Data and Bit Flip Register 28 */
#define MTU_MC9_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061998u)

/** \brief 99A, Read Data and Bit Flip Register 29 */
#define MTU_MC9_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006199Au)

/** \brief 99C, Read Data and Bit Flip Register 30 */
#define MTU_MC9_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006199Cu)

/** \brief 99E, Read Data and Bit Flip Register 31 */
#define MTU_MC9_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006199Eu)

/** \brief 9A0, Read Data and Bit Flip Register 32 */
#define MTU_MC9_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A0u)

/** \brief 9A2, Read Data and Bit Flip Register 33 */
#define MTU_MC9_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A2u)

/** \brief 9A4, Read Data and Bit Flip Register 34 */
#define MTU_MC9_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A4u)

/** \brief 9A6, Read Data and Bit Flip Register 35 */
#define MTU_MC9_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A6u)

/** \brief 9A8, Read Data and Bit Flip Register 36 */
#define MTU_MC9_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619A8u)

/** \brief 9AA, Read Data and Bit Flip Register 37 */
#define MTU_MC9_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619AAu)

/** \brief 9AC, Read Data and Bit Flip Register 38 */
#define MTU_MC9_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619ACu)

/** \brief 9AE, Read Data and Bit Flip Register 39 */
#define MTU_MC9_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619AEu)

/** \brief 9B0, Read Data and Bit Flip Register 40 */
#define MTU_MC9_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B0u)

/** \brief 9B2, Read Data and Bit Flip Register 41 */
#define MTU_MC9_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B2u)

/** \brief 9B4, Read Data and Bit Flip Register 42 */
#define MTU_MC9_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B4u)

/** \brief 9B6, Read Data and Bit Flip Register 43 */
#define MTU_MC9_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B6u)

/** \brief 9B8, Read Data and Bit Flip Register 44 */
#define MTU_MC9_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619B8u)

/** \brief 9BA, Read Data and Bit Flip Register 45 */
#define MTU_MC9_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619BAu)

/** \brief 9BC, Read Data and Bit Flip Register 46 */
#define MTU_MC9_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619BCu)

/** \brief 9BE, Read Data and Bit Flip Register 47 */
#define MTU_MC9_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619BEu)

/** \brief 9C0, Read Data and Bit Flip Register 48 */
#define MTU_MC9_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C0u)

/** \brief 9C2, Read Data and Bit Flip Register 49 */
#define MTU_MC9_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C2u)

/** \brief 9C4, Read Data and Bit Flip Register 50 */
#define MTU_MC9_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C4u)

/** \brief 9C6, Read Data and Bit Flip Register 51 */
#define MTU_MC9_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C6u)

/** \brief 9C8, Read Data and Bit Flip Register 52 */
#define MTU_MC9_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619C8u)

/** \brief 9CA, Read Data and Bit Flip Register 53 */
#define MTU_MC9_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619CAu)

/** \brief 9CC, Read Data and Bit Flip Register 54 */
#define MTU_MC9_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619CCu)

/** \brief 9CE, Read Data and Bit Flip Register 55 */
#define MTU_MC9_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619CEu)

/** \brief 9D0, Read Data and Bit Flip Register 56 */
#define MTU_MC9_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D0u)

/** \brief 9D2, Read Data and Bit Flip Register 57 */
#define MTU_MC9_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D2u)

/** \brief 9D4, Read Data and Bit Flip Register 58 */
#define MTU_MC9_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D4u)

/** \brief 9D6, Read Data and Bit Flip Register 59 */
#define MTU_MC9_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D6u)

/** \brief 9D8, Read Data and Bit Flip Register 60 */
#define MTU_MC9_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619D8u)

/** \brief 9DA, Read Data and Bit Flip Register 61 */
#define MTU_MC9_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619DAu)

/** \brief 9DC, Read Data and Bit Flip Register 62 */
#define MTU_MC9_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619DCu)

/** \brief 9DE, Read Data and Bit Flip Register 63 */
#define MTU_MC9_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619DEu)

/** \brief 9E0, Read Data and Bit Flip Register 64 */
#define MTU_MC9_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619E0u)

/** \brief 9E2, Read Data and Bit Flip Register 65 */
#define MTU_MC9_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619E2u)

/** \brief 9E4, Read Data and Bit Flip Register 66 */
#define MTU_MC9_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00619E4u)

/** \brief 9EE, Alarm Sources Configuration Register */
#define MTU_MC9_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00619EEu)

/** \brief 9F0, SSH Safety Faults Status Register  */
#define MTU_MC9_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00619F0u)

