Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 1294, Read Data and Bit Flip Register 26 */
#define MTU_MC18_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062294u)

/** \brief 1296, Read Data and Bit Flip Register 27 */
#define MTU_MC18_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062296u)

/** \brief 1298, Read Data and Bit Flip Register 28 */
#define MTU_MC18_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062298u)

/** \brief 129A, Read Data and Bit Flip Register 29 */
#define MTU_MC18_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006229Au)

/** \brief 129C, Read Data and Bit Flip Register 30 */
#define MTU_MC18_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006229Cu)

/** \brief 129E, Read Data and Bit Flip Register 31 */
#define MTU_MC18_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006229Eu)

/** \brief 12A0, Read Data and Bit Flip Register 32 */
#define MTU_MC18_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A0u)

/** \brief 12A2, Read Data and Bit Flip Register 33 */
#define MTU_MC18_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A2u)

/** \brief 12A4, Read Data and Bit Flip Register 34 */
#define MTU_MC18_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A4u)

/** \brief 12A6, Read Data and Bit Flip Register 35 */
#define MTU_MC18_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A6u)

/** \brief 12A8, Read Data and Bit Flip Register 36 */
#define MTU_MC18_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622A8u)

/** \brief 12AA, Read Data and Bit Flip Register 37 */
#define MTU_MC18_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622AAu)

/** \brief 12AC, Read Data and Bit Flip Register 38 */
#define MTU_MC18_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622ACu)

/** \brief 12AE, Read Data and Bit Flip Register 39 */
#define MTU_MC18_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622AEu)

/** \brief 12B0, Read Data and Bit Flip Register 40 */
#define MTU_MC18_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B0u)

/** \brief 12B2, Read Data and Bit Flip Register 41 */
#define MTU_MC18_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B2u)

/** \brief 12B4, Read Data and Bit Flip Register 42 */
#define MTU_MC18_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B4u)

/** \brief 12B6, Read Data and Bit Flip Register 43 */
#define MTU_MC18_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B6u)

/** \brief 12B8, Read Data and Bit Flip Register 44 */
#define MTU_MC18_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622B8u)

/** \brief 12BA, Read Data and Bit Flip Register 45 */
#define MTU_MC18_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622BAu)

/** \brief 12BC, Read Data and Bit Flip Register 46 */
#define MTU_MC18_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622BCu)

/** \brief 12BE, Read Data and Bit Flip Register 47 */
#define MTU_MC18_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622BEu)

/** \brief 12C0, Read Data and Bit Flip Register 48 */
#define MTU_MC18_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C0u)

/** \brief 12C2, Read Data and Bit Flip Register 49 */
#define MTU_MC18_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C2u)

/** \brief 12C4, Read Data and Bit Flip Register 50 */
#define MTU_MC18_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C4u)

/** \brief 12C6, Read Data and Bit Flip Register 51 */
#define MTU_MC18_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C6u)

/** \brief 12C8, Read Data and Bit Flip Register 52 */
#define MTU_MC18_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622C8u)

/** \brief 12CA, Read Data and Bit Flip Register 53 */
#define MTU_MC18_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622CAu)

/** \brief 12CC, Read Data and Bit Flip Register 54 */
#define MTU_MC18_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622CCu)

/** \brief 12CE, Read Data and Bit Flip Register 55 */
#define MTU_MC18_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622CEu)

/** \brief 12D0, Read Data and Bit Flip Register 56 */
#define MTU_MC18_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D0u)

/** \brief 12D2, Read Data and Bit Flip Register 57 */
#define MTU_MC18_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D2u)

/** \brief 12D4, Read Data and Bit Flip Register 58 */
#define MTU_MC18_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D4u)

/** \brief 12D6, Read Data and Bit Flip Register 59 */
#define MTU_MC18_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D6u)

/** \brief 12D8, Read Data and Bit Flip Register 60 */
#define MTU_MC18_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622D8u)

/** \brief 12DA, Read Data and Bit Flip Register 61 */
#define MTU_MC18_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622DAu)

/** \brief 12DC, Read Data and Bit Flip Register 62 */
#define MTU_MC18_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622DCu)

/** \brief 12DE, Read Data and Bit Flip Register 63 */
#define MTU_MC18_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622DEu)

/** \brief 12E0, Read Data and Bit Flip Register 64 */
#define MTU_MC18_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622E0u)

/** \brief 12E2, Read Data and Bit Flip Register 65 */
#define MTU_MC18_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622E2u)

/** \brief 12E4, Read Data and Bit Flip Register 66 */
#define MTU_MC18_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00622E4u)

/** \brief 12EE, Alarm Sources Configuration Register */
#define MTU_MC18_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00622EEu)

/** \brief 12F0, SSH Safety Faults Status Register  */
#define MTU_MC18_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00622F0u)

/** \brief 12F2, Error Information Register 0 */
#define MTU_MC18_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F2u)

/** \brief 12F4, Error Information Register 1 */
#define MTU_MC18_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F4u)

