Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 2164, Read Data and Bit Flip Register 2 */
#define MTU_MC33_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063164u)

/** \brief 2166, Read Data and Bit Flip Register 3 */
#define MTU_MC33_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063166u)

/** \brief 2168, Read Data and Bit Flip Register 4 */
#define MTU_MC33_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063168u)

/** \brief 216A, Read Data and Bit Flip Register 5 */
#define MTU_MC33_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006316Au)

/** \brief 216C, Read Data and Bit Flip Register 6 */
#define MTU_MC33_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006316Cu)

/** \brief 216E, Read Data and Bit Flip Register 7 */
#define MTU_MC33_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006316Eu)

/** \brief 2170, Read Data and Bit Flip Register 8 */
#define MTU_MC33_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063170u)

/** \brief 2172, Read Data and Bit Flip Register 9 */
#define MTU_MC33_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063172u)

/** \brief 2174, Read Data and Bit Flip Register 10 */
#define MTU_MC33_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063174u)

/** \brief 2176, Read Data and Bit Flip Register 11 */
#define MTU_MC33_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063176u)

/** \brief 2178, Read Data and Bit Flip Register 12 */
#define MTU_MC33_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063178u)

/** \brief 217A, Read Data and Bit Flip Register 13 */
#define MTU_MC33_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006317Au)

/** \brief 217C, Read Data and Bit Flip Register 14 */
#define MTU_MC33_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006317Cu)

/** \brief 217E, Read Data and Bit Flip Register 15 */
#define MTU_MC33_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006317Eu)

/** \brief 2180, Read Data and Bit Flip Register 16 */
#define MTU_MC33_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063180u)

/** \brief 2182, Read Data and Bit Flip Register 17 */
#define MTU_MC33_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063182u)

/** \brief 2184, Read Data and Bit Flip Register 18 */
#define MTU_MC33_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063184u)

/** \brief 2186, Read Data and Bit Flip Register 19 */
#define MTU_MC33_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063186u)

/** \brief 2188, Read Data and Bit Flip Register 20 */
#define MTU_MC33_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063188u)

/** \brief 218A, Read Data and Bit Flip Register 21 */
#define MTU_MC33_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006318Au)

/** \brief 218C, Read Data and Bit Flip Register 22 */
#define MTU_MC33_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006318Cu)

/** \brief 218E, Read Data and Bit Flip Register 23 */
#define MTU_MC33_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006318Eu)

/** \brief 2190, Read Data and Bit Flip Register 24 */
#define MTU_MC33_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063190u)

/** \brief 2192, Read Data and Bit Flip Register 25 */
#define MTU_MC33_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063192u)

/** \brief 2194, Read Data and Bit Flip Register 26 */
#define MTU_MC33_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063194u)

/** \brief 2196, Read Data and Bit Flip Register 27 */
#define MTU_MC33_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063196u)

/** \brief 2198, Read Data and Bit Flip Register 28 */
#define MTU_MC33_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063198u)

/** \brief 219A, Read Data and Bit Flip Register 29 */
#define MTU_MC33_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006319Au)

/** \brief 219C, Read Data and Bit Flip Register 30 */
#define MTU_MC33_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006319Cu)

/** \brief 219E, Read Data and Bit Flip Register 31 */
#define MTU_MC33_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006319Eu)

/** \brief 21A0, Read Data and Bit Flip Register 32 */
#define MTU_MC33_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A0u)

/** \brief 21A2, Read Data and Bit Flip Register 33 */
#define MTU_MC33_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A2u)

/** \brief 21A4, Read Data and Bit Flip Register 34 */
#define MTU_MC33_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A4u)

/** \brief 21A6, Read Data and Bit Flip Register 35 */
#define MTU_MC33_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A6u)

/** \brief 21A8, Read Data and Bit Flip Register 36 */
#define MTU_MC33_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631A8u)

/** \brief 21AA, Read Data and Bit Flip Register 37 */
#define MTU_MC33_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631AAu)

/** \brief 21AC, Read Data and Bit Flip Register 38 */
#define MTU_MC33_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631ACu)

/** \brief 21AE, Read Data and Bit Flip Register 39 */
#define MTU_MC33_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631AEu)

/** \brief 21B0, Read Data and Bit Flip Register 40 */
#define MTU_MC33_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B0u)

/** \brief 21B2, Read Data and Bit Flip Register 41 */
#define MTU_MC33_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B2u)

/** \brief 21B4, Read Data and Bit Flip Register 42 */
#define MTU_MC33_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00631B4u)

