Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 3174, Read Data and Bit Flip Register 10 */
#define MTU_MC49_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064174u)

/** \brief 3176, Read Data and Bit Flip Register 11 */
#define MTU_MC49_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064176u)

/** \brief 3178, Read Data and Bit Flip Register 12 */
#define MTU_MC49_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064178u)

/** \brief 317A, Read Data and Bit Flip Register 13 */
#define MTU_MC49_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006417Au)

/** \brief 317C, Read Data and Bit Flip Register 14 */
#define MTU_MC49_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006417Cu)

/** \brief 317E, Read Data and Bit Flip Register 15 */
#define MTU_MC49_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006417Eu)

/** \brief 3180, Read Data and Bit Flip Register 16 */
#define MTU_MC49_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064180u)

/** \brief 3182, Read Data and Bit Flip Register 17 */
#define MTU_MC49_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064182u)

/** \brief 3184, Read Data and Bit Flip Register 18 */
#define MTU_MC49_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064184u)

/** \brief 3186, Read Data and Bit Flip Register 19 */
#define MTU_MC49_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064186u)

/** \brief 3188, Read Data and Bit Flip Register 20 */
#define MTU_MC49_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064188u)

/** \brief 318A, Read Data and Bit Flip Register 21 */
#define MTU_MC49_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006418Au)

/** \brief 318C, Read Data and Bit Flip Register 22 */
#define MTU_MC49_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006418Cu)

/** \brief 318E, Read Data and Bit Flip Register 23 */
#define MTU_MC49_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006418Eu)

/** \brief 3190, Read Data and Bit Flip Register 24 */
#define MTU_MC49_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064190u)

/** \brief 3192, Read Data and Bit Flip Register 25 */
#define MTU_MC49_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064192u)

/** \brief 3194, Read Data and Bit Flip Register 26 */
#define MTU_MC49_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064194u)

/** \brief 3196, Read Data and Bit Flip Register 27 */
#define MTU_MC49_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064196u)

/** \brief 3198, Read Data and Bit Flip Register 28 */
#define MTU_MC49_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064198u)

/** \brief 319A, Read Data and Bit Flip Register 29 */
#define MTU_MC49_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006419Au)

/** \brief 319C, Read Data and Bit Flip Register 30 */
#define MTU_MC49_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006419Cu)

/** \brief 319E, Read Data and Bit Flip Register 31 */
#define MTU_MC49_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006419Eu)

/** \brief 31A0, Read Data and Bit Flip Register 32 */
#define MTU_MC49_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A0u)

/** \brief 31A2, Read Data and Bit Flip Register 33 */
#define MTU_MC49_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A2u)

/** \brief 31A4, Read Data and Bit Flip Register 34 */
#define MTU_MC49_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A4u)

/** \brief 31A6, Read Data and Bit Flip Register 35 */
#define MTU_MC49_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A6u)

/** \brief 31A8, Read Data and Bit Flip Register 36 */
#define MTU_MC49_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641A8u)

/** \brief 31AA, Read Data and Bit Flip Register 37 */
#define MTU_MC49_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641AAu)

/** \brief 31AC, Read Data and Bit Flip Register 38 */
#define MTU_MC49_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641ACu)

/** \brief 31AE, Read Data and Bit Flip Register 39 */
#define MTU_MC49_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641AEu)

/** \brief 31B0, Read Data and Bit Flip Register 40 */
#define MTU_MC49_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B0u)

/** \brief 31B2, Read Data and Bit Flip Register 41 */
#define MTU_MC49_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B2u)

/** \brief 31B4, Read Data and Bit Flip Register 42 */
#define MTU_MC49_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B4u)

/** \brief 31B6, Read Data and Bit Flip Register 43 */
#define MTU_MC49_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B6u)

/** \brief 31B8, Read Data and Bit Flip Register 44 */
#define MTU_MC49_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641B8u)

/** \brief 31BA, Read Data and Bit Flip Register 45 */
#define MTU_MC49_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641BAu)

/** \brief 31BC, Read Data and Bit Flip Register 46 */
#define MTU_MC49_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641BCu)

/** \brief 31BE, Read Data and Bit Flip Register 47 */
#define MTU_MC49_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641BEu)

/** \brief 31C0, Read Data and Bit Flip Register 48 */
#define MTU_MC49_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C0u)

/** \brief 31C2, Read Data and Bit Flip Register 49 */
#define MTU_MC49_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C2u)

/** \brief 31C4, Read Data and Bit Flip Register 50 */
#define MTU_MC49_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C4u)

/** \brief 31C6, Read Data and Bit Flip Register 51 */
#define MTU_MC49_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00641C6u)

