Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 3F14, Error Tracking Register 1 */
#define MTU_MC63_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F14u)

/** \brief 3F16, Error Tracking Register 2 */
#define MTU_MC63_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F16u)

/** \brief 3F18, Error Tracking Register 3 */
#define MTU_MC63_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F18u)

/** \brief 3F1A, Error Tracking Register 4 */
#define MTU_MC63_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064F1Au)

/** \brief 3F60, Read Data and Bit Flip Register 0 */
#define MTU_MC63_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F60u)

/** \brief 3F62, Read Data and Bit Flip Register 1 */
#define MTU_MC63_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F62u)

/** \brief 3F64, Read Data and Bit Flip Register 2 */
#define MTU_MC63_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F64u)

/** \brief 3F66, Read Data and Bit Flip Register 3 */
#define MTU_MC63_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F66u)

/** \brief 3F68, Read Data and Bit Flip Register 4 */
#define MTU_MC63_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F68u)

/** \brief 3F6A, Read Data and Bit Flip Register 5 */
#define MTU_MC63_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F6Au)

/** \brief 3F6C, Read Data and Bit Flip Register 6 */
#define MTU_MC63_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F6Cu)

/** \brief 3F6E, Read Data and Bit Flip Register 7 */
#define MTU_MC63_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F6Eu)

/** \brief 3F70, Read Data and Bit Flip Register 8 */
#define MTU_MC63_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F70u)

/** \brief 3F72, Read Data and Bit Flip Register 9 */
#define MTU_MC63_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F72u)

/** \brief 3F74, Read Data and Bit Flip Register 10 */
#define MTU_MC63_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F74u)

/** \brief 3F76, Read Data and Bit Flip Register 11 */
#define MTU_MC63_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F76u)

/** \brief 3F78, Read Data and Bit Flip Register 12 */
#define MTU_MC63_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F78u)

/** \brief 3F7A, Read Data and Bit Flip Register 13 */
#define MTU_MC63_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F7Au)

/** \brief 3F7C, Read Data and Bit Flip Register 14 */
#define MTU_MC63_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F7Cu)

/** \brief 3F7E, Read Data and Bit Flip Register 15 */
#define MTU_MC63_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F7Eu)

/** \brief 3F80, Read Data and Bit Flip Register 16 */
#define MTU_MC63_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F80u)

/** \brief 3F82, Read Data and Bit Flip Register 17 */
#define MTU_MC63_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F82u)

/** \brief 3F84, Read Data and Bit Flip Register 18 */
#define MTU_MC63_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F84u)

/** \brief 3F86, Read Data and Bit Flip Register 19 */
#define MTU_MC63_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F86u)

/** \brief 3F88, Read Data and Bit Flip Register 20 */
#define MTU_MC63_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F88u)

/** \brief 3F8A, Read Data and Bit Flip Register 21 */
#define MTU_MC63_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F8Au)

/** \brief 3F8C, Read Data and Bit Flip Register 22 */
#define MTU_MC63_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F8Cu)

/** \brief 3F8E, Read Data and Bit Flip Register 23 */
#define MTU_MC63_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F8Eu)

/** \brief 3F90, Read Data and Bit Flip Register 24 */
#define MTU_MC63_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F90u)

/** \brief 3F92, Read Data and Bit Flip Register 25 */
#define MTU_MC63_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F92u)

/** \brief 3F94, Read Data and Bit Flip Register 26 */
#define MTU_MC63_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F94u)

/** \brief 3F96, Read Data and Bit Flip Register 27 */
#define MTU_MC63_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F96u)

/** \brief 3F98, Read Data and Bit Flip Register 28 */
#define MTU_MC63_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F98u)

/** \brief 3F9A, Read Data and Bit Flip Register 29 */
#define MTU_MC63_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F9Au)

/** \brief 3F9C, Read Data and Bit Flip Register 30 */
#define MTU_MC63_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F9Cu)

/** \brief 3F9E, Read Data and Bit Flip Register 31 */
#define MTU_MC63_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064F9Eu)

/** \brief 3FA0, Read Data and Bit Flip Register 32 */
#define MTU_MC63_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA0u)

/** \brief 3FA2, Read Data and Bit Flip Register 33 */
#define MTU_MC63_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA2u)

/** \brief 3FA4, Read Data and Bit Flip Register 34 */
#define MTU_MC63_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA4u)

/** \brief 3FA6, Read Data and Bit Flip Register 35 */
#define MTU_MC63_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA6u)

/** \brief 3FA8, Read Data and Bit Flip Register 36 */
#define MTU_MC63_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FA8u)

/** \brief 3FAA, Read Data and Bit Flip Register 37 */
#define MTU_MC63_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FAAu)

/** \brief 3FAC, Read Data and Bit Flip Register 38 */
#define MTU_MC63_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FACu)

/** \brief 3FAE, Read Data and Bit Flip Register 39 */
#define MTU_MC63_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FAEu)

/** \brief 3FB0, Read Data and Bit Flip Register 40 */
#define MTU_MC63_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB0u)

/** \brief 3FB2, Read Data and Bit Flip Register 41 */
#define MTU_MC63_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB2u)

/** \brief 3FB4, Read Data and Bit Flip Register 42 */
#define MTU_MC63_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB4u)

/** \brief 3FB6, Read Data and Bit Flip Register 43 */
#define MTU_MC63_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB6u)

/** \brief 3FB8, Read Data and Bit Flip Register 44 */
#define MTU_MC63_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FB8u)

/** \brief 3FBA, Read Data and Bit Flip Register 45 */
#define MTU_MC63_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FBAu)

/** \brief 3FBC, Read Data and Bit Flip Register 46 */
#define MTU_MC63_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FBCu)

/** \brief 3FBE, Read Data and Bit Flip Register 47 */
#define MTU_MC63_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FBEu)

/** \brief 3FC0, Read Data and Bit Flip Register 48 */
#define MTU_MC63_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC0u)

/** \brief 3FC2, Read Data and Bit Flip Register 49 */
#define MTU_MC63_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC2u)

/** \brief 3FC4, Read Data and Bit Flip Register 50 */
#define MTU_MC63_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC4u)

/** \brief 3FC6, Read Data and Bit Flip Register 51 */
#define MTU_MC63_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC6u)

/** \brief 3FC8, Read Data and Bit Flip Register 52 */
#define MTU_MC63_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FC8u)

/** \brief 3FCA, Read Data and Bit Flip Register 53 */
#define MTU_MC63_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064FCAu)

