Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 4992, Read Data and Bit Flip Register 25 */
#define MTU_MC73_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065992u)

/** \brief 4994, Read Data and Bit Flip Register 26 */
#define MTU_MC73_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065994u)

/** \brief 4996, Read Data and Bit Flip Register 27 */
#define MTU_MC73_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065996u)

/** \brief 4998, Read Data and Bit Flip Register 28 */
#define MTU_MC73_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065998u)

/** \brief 499A, Read Data and Bit Flip Register 29 */
#define MTU_MC73_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006599Au)

/** \brief 499C, Read Data and Bit Flip Register 30 */
#define MTU_MC73_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006599Cu)

/** \brief 499E, Read Data and Bit Flip Register 31 */
#define MTU_MC73_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006599Eu)

/** \brief 49A0, Read Data and Bit Flip Register 32 */
#define MTU_MC73_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A0u)

/** \brief 49A2, Read Data and Bit Flip Register 33 */
#define MTU_MC73_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A2u)

/** \brief 49A4, Read Data and Bit Flip Register 34 */
#define MTU_MC73_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A4u)

/** \brief 49A6, Read Data and Bit Flip Register 35 */
#define MTU_MC73_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A6u)

/** \brief 49A8, Read Data and Bit Flip Register 36 */
#define MTU_MC73_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659A8u)

/** \brief 49AA, Read Data and Bit Flip Register 37 */
#define MTU_MC73_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659AAu)

/** \brief 49AC, Read Data and Bit Flip Register 38 */
#define MTU_MC73_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659ACu)

/** \brief 49AE, Read Data and Bit Flip Register 39 */
#define MTU_MC73_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659AEu)

/** \brief 49B0, Read Data and Bit Flip Register 40 */
#define MTU_MC73_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B0u)

/** \brief 49B2, Read Data and Bit Flip Register 41 */
#define MTU_MC73_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B2u)

/** \brief 49B4, Read Data and Bit Flip Register 42 */
#define MTU_MC73_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B4u)

/** \brief 49B6, Read Data and Bit Flip Register 43 */
#define MTU_MC73_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B6u)

/** \brief 49B8, Read Data and Bit Flip Register 44 */
#define MTU_MC73_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659B8u)

/** \brief 49BA, Read Data and Bit Flip Register 45 */
#define MTU_MC73_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659BAu)

/** \brief 49BC, Read Data and Bit Flip Register 46 */
#define MTU_MC73_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659BCu)

/** \brief 49BE, Read Data and Bit Flip Register 47 */
#define MTU_MC73_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659BEu)

/** \brief 49C0, Read Data and Bit Flip Register 48 */
#define MTU_MC73_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C0u)

/** \brief 49C2, Read Data and Bit Flip Register 49 */
#define MTU_MC73_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C2u)

/** \brief 49C4, Read Data and Bit Flip Register 50 */
#define MTU_MC73_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C4u)

/** \brief 49C6, Read Data and Bit Flip Register 51 */
#define MTU_MC73_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C6u)

/** \brief 49C8, Read Data and Bit Flip Register 52 */
#define MTU_MC73_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659C8u)

/** \brief 49CA, Read Data and Bit Flip Register 53 */
#define MTU_MC73_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659CAu)

/** \brief 49CC, Read Data and Bit Flip Register 54 */
#define MTU_MC73_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659CCu)

/** \brief 49CE, Read Data and Bit Flip Register 55 */
#define MTU_MC73_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659CEu)

/** \brief 49D0, Read Data and Bit Flip Register 56 */
#define MTU_MC73_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D0u)

/** \brief 49D2, Read Data and Bit Flip Register 57 */
#define MTU_MC73_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D2u)

/** \brief 49D4, Read Data and Bit Flip Register 58 */
#define MTU_MC73_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D4u)

/** \brief 49D6, Read Data and Bit Flip Register 59 */
#define MTU_MC73_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D6u)

/** \brief 49D8, Read Data and Bit Flip Register 60 */
#define MTU_MC73_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659D8u)

/** \brief 49DA, Read Data and Bit Flip Register 61 */
#define MTU_MC73_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659DAu)

/** \brief 49DC, Read Data and Bit Flip Register 62 */
#define MTU_MC73_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659DCu)

/** \brief 49DE, Read Data and Bit Flip Register 63 */
#define MTU_MC73_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659DEu)

/** \brief 49E0, Read Data and Bit Flip Register 64 */
#define MTU_MC73_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659E0u)

/** \brief 49E2, Read Data and Bit Flip Register 65 */
#define MTU_MC73_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659E2u)

/** \brief 49E4, Read Data and Bit Flip Register 66 */
#define MTU_MC73_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00659E4u)

/** \brief 49EE, Alarm Sources Configuration Register */
#define MTU_MC73_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00659EEu)

