Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 4C04, MBIST Control Register */
#define MTU_MC76_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065C04u)

/** \brief 4C06, Status Register */
#define MTU_MC76_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065C06u)

/** \brief 4C08, Range Register, single address mode */
#define MTU_MC76_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065C08u)

/** \brief 4C0C, Revision ID Register */
#define MTU_MC76_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065C0Cu)

/** \brief 4C0E, ECC Safety Register */
#define MTU_MC76_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065C0Eu)

/** \brief 4C10, Memory ECC Detection Register */
#define MTU_MC76_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065C10u)

/** \brief 4C12, Error Tracking Register 0 */
#define MTU_MC76_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065C12u)

/** \brief 4C14, Error Tracking Register 1 */
#define MTU_MC76_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065C14u)

/** \brief 4C16, Error Tracking Register 2 */
#define MTU_MC76_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065C16u)

/** \brief 4C18, Error Tracking Register 3 */
#define MTU_MC76_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065C18u)

/** \brief 4C1A, Error Tracking Register 4 */
#define MTU_MC76_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065C1Au)

/** \brief 4C60, Read Data and Bit Flip Register 0 */
#define MTU_MC76_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C60u)

/** \brief 4C62, Read Data and Bit Flip Register 1 */
#define MTU_MC76_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C62u)

/** \brief 4C64, Read Data and Bit Flip Register 2 */
#define MTU_MC76_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C64u)

/** \brief 4C66, Read Data and Bit Flip Register 3 */
#define MTU_MC76_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C66u)

/** \brief 4C68, Read Data and Bit Flip Register 4 */
#define MTU_MC76_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C68u)

/** \brief 4C6A, Read Data and Bit Flip Register 5 */
#define MTU_MC76_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C6Au)

/** \brief 4C6C, Read Data and Bit Flip Register 6 */
#define MTU_MC76_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C6Cu)

/** \brief 4C6E, Read Data and Bit Flip Register 7 */
#define MTU_MC76_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C6Eu)

/** \brief 4C70, Read Data and Bit Flip Register 8 */
#define MTU_MC76_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C70u)

/** \brief 4C72, Read Data and Bit Flip Register 9 */
#define MTU_MC76_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C72u)

/** \brief 4C74, Read Data and Bit Flip Register 10 */
#define MTU_MC76_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C74u)

/** \brief 4C76, Read Data and Bit Flip Register 11 */
#define MTU_MC76_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C76u)

/** \brief 4C78, Read Data and Bit Flip Register 12 */
#define MTU_MC76_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C78u)

/** \brief 4C7A, Read Data and Bit Flip Register 13 */
#define MTU_MC76_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C7Au)

/** \brief 4C7C, Read Data and Bit Flip Register 14 */
#define MTU_MC76_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C7Cu)

/** \brief 4C7E, Read Data and Bit Flip Register 15 */
#define MTU_MC76_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C7Eu)

/** \brief 4C80, Read Data and Bit Flip Register 16 */
#define MTU_MC76_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C80u)

/** \brief 4C82, Read Data and Bit Flip Register 17 */
#define MTU_MC76_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C82u)

/** \brief 4C84, Read Data and Bit Flip Register 18 */
#define MTU_MC76_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C84u)

/** \brief 4C86, Read Data and Bit Flip Register 19 */
#define MTU_MC76_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C86u)

/** \brief 4C88, Read Data and Bit Flip Register 20 */
#define MTU_MC76_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C88u)

/** \brief 4C8A, Read Data and Bit Flip Register 21 */
#define MTU_MC76_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C8Au)

/** \brief 4C8C, Read Data and Bit Flip Register 22 */
#define MTU_MC76_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C8Cu)

/** \brief 4C8E, Read Data and Bit Flip Register 23 */
#define MTU_MC76_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C8Eu)

/** \brief 4C90, Read Data and Bit Flip Register 24 */
#define MTU_MC76_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C90u)

/** \brief 4C92, Read Data and Bit Flip Register 25 */
#define MTU_MC76_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C92u)

/** \brief 4C94, Read Data and Bit Flip Register 26 */
#define MTU_MC76_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C94u)

/** \brief 4C96, Read Data and Bit Flip Register 27 */
#define MTU_MC76_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C96u)

/** \brief 4C98, Read Data and Bit Flip Register 28 */
#define MTU_MC76_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C98u)

/** \brief 4C9A, Read Data and Bit Flip Register 29 */
#define MTU_MC76_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C9Au)

/** \brief 4C9C, Read Data and Bit Flip Register 30 */
#define MTU_MC76_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C9Cu)

/** \brief 4C9E, Read Data and Bit Flip Register 31 */
#define MTU_MC76_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065C9Eu)

/** \brief 4CA0, Read Data and Bit Flip Register 32 */
#define MTU_MC76_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CA0u)

/** \brief 4CA2, Read Data and Bit Flip Register 33 */
#define MTU_MC76_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CA2u)

