Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 4F9E, Read Data and Bit Flip Register 31 */
#define MTU_MC79_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065F9Eu)

/** \brief 4FA0, Read Data and Bit Flip Register 32 */
#define MTU_MC79_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA0u)

/** \brief 4FA2, Read Data and Bit Flip Register 33 */
#define MTU_MC79_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA2u)

/** \brief 4FA4, Read Data and Bit Flip Register 34 */
#define MTU_MC79_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA4u)

/** \brief 4FA6, Read Data and Bit Flip Register 35 */
#define MTU_MC79_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA6u)

/** \brief 4FA8, Read Data and Bit Flip Register 36 */
#define MTU_MC79_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FA8u)

/** \brief 4FAA, Read Data and Bit Flip Register 37 */
#define MTU_MC79_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FAAu)

/** \brief 4FAC, Read Data and Bit Flip Register 38 */
#define MTU_MC79_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FACu)

/** \brief 4FAE, Read Data and Bit Flip Register 39 */
#define MTU_MC79_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FAEu)

/** \brief 4FB0, Read Data and Bit Flip Register 40 */
#define MTU_MC79_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB0u)

/** \brief 4FB2, Read Data and Bit Flip Register 41 */
#define MTU_MC79_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB2u)

/** \brief 4FB4, Read Data and Bit Flip Register 42 */
#define MTU_MC79_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB4u)

/** \brief 4FB6, Read Data and Bit Flip Register 43 */
#define MTU_MC79_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB6u)

/** \brief 4FB8, Read Data and Bit Flip Register 44 */
#define MTU_MC79_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FB8u)

/** \brief 4FBA, Read Data and Bit Flip Register 45 */
#define MTU_MC79_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FBAu)

/** \brief 4FBC, Read Data and Bit Flip Register 46 */
#define MTU_MC79_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FBCu)

/** \brief 4FBE, Read Data and Bit Flip Register 47 */
#define MTU_MC79_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FBEu)

/** \brief 4FC0, Read Data and Bit Flip Register 48 */
#define MTU_MC79_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC0u)

/** \brief 4FC2, Read Data and Bit Flip Register 49 */
#define MTU_MC79_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC2u)

/** \brief 4FC4, Read Data and Bit Flip Register 50 */
#define MTU_MC79_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC4u)

/** \brief 4FC6, Read Data and Bit Flip Register 51 */
#define MTU_MC79_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC6u)

/** \brief 4FC8, Read Data and Bit Flip Register 52 */
#define MTU_MC79_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FC8u)

/** \brief 4FCA, Read Data and Bit Flip Register 53 */
#define MTU_MC79_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FCAu)

/** \brief 4FCC, Read Data and Bit Flip Register 54 */
#define MTU_MC79_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FCCu)

/** \brief 4FCE, Read Data and Bit Flip Register 55 */
#define MTU_MC79_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FCEu)

/** \brief 4FD0, Read Data and Bit Flip Register 56 */
#define MTU_MC79_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD0u)

/** \brief 4FD2, Read Data and Bit Flip Register 57 */
#define MTU_MC79_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD2u)

/** \brief 4FD4, Read Data and Bit Flip Register 58 */
#define MTU_MC79_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD4u)

/** \brief 4FD6, Read Data and Bit Flip Register 59 */
#define MTU_MC79_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD6u)

/** \brief 4FD8, Read Data and Bit Flip Register 60 */
#define MTU_MC79_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FD8u)

/** \brief 4FDA, Read Data and Bit Flip Register 61 */
#define MTU_MC79_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FDAu)

/** \brief 4FDC, Read Data and Bit Flip Register 62 */
#define MTU_MC79_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FDCu)

/** \brief 4FDE, Read Data and Bit Flip Register 63 */
#define MTU_MC79_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FDEu)

/** \brief 4FE0, Read Data and Bit Flip Register 64 */
#define MTU_MC79_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FE0u)

/** \brief 4FE2, Read Data and Bit Flip Register 65 */
#define MTU_MC79_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FE2u)

/** \brief 4FE4, Read Data and Bit Flip Register 66 */
#define MTU_MC79_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065FE4u)

/** \brief 4FEE, Alarm Sources Configuration Register */
#define MTU_MC79_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0065FEEu)

/** \brief 4FF0, SSH Safety Faults Status Register  */
#define MTU_MC79_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0065FF0u)

/** \brief 4FF2, Error Information Register 0 */
#define MTU_MC79_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF2u)

/** \brief 4FF4, Error Information Register 1 */
#define MTU_MC79_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF4u)

/** \brief 4FF6, Error Information Register 2 */
#define MTU_MC79_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF6u)

