Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 5476, Read Data and Bit Flip Register 11 */
#define MTU_MC84_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066476u)

/** \brief 5478, Read Data and Bit Flip Register 12 */
#define MTU_MC84_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066478u)

/** \brief 547A, Read Data and Bit Flip Register 13 */
#define MTU_MC84_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006647Au)

/** \brief 547C, Read Data and Bit Flip Register 14 */
#define MTU_MC84_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006647Cu)

/** \brief 547E, Read Data and Bit Flip Register 15 */
#define MTU_MC84_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006647Eu)

/** \brief 5480, Read Data and Bit Flip Register 16 */
#define MTU_MC84_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066480u)

/** \brief 5482, Read Data and Bit Flip Register 17 */
#define MTU_MC84_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066482u)

/** \brief 5484, Read Data and Bit Flip Register 18 */
#define MTU_MC84_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066484u)

/** \brief 5486, Read Data and Bit Flip Register 19 */
#define MTU_MC84_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066486u)

/** \brief 5488, Read Data and Bit Flip Register 20 */
#define MTU_MC84_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066488u)

/** \brief 548A, Read Data and Bit Flip Register 21 */
#define MTU_MC84_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006648Au)

/** \brief 548C, Read Data and Bit Flip Register 22 */
#define MTU_MC84_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006648Cu)

/** \brief 548E, Read Data and Bit Flip Register 23 */
#define MTU_MC84_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006648Eu)

/** \brief 5490, Read Data and Bit Flip Register 24 */
#define MTU_MC84_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066490u)

/** \brief 5492, Read Data and Bit Flip Register 25 */
#define MTU_MC84_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066492u)

/** \brief 5494, Read Data and Bit Flip Register 26 */
#define MTU_MC84_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066494u)

/** \brief 5496, Read Data and Bit Flip Register 27 */
#define MTU_MC84_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066496u)

/** \brief 5498, Read Data and Bit Flip Register 28 */
#define MTU_MC84_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066498u)

/** \brief 549A, Read Data and Bit Flip Register 29 */
#define MTU_MC84_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006649Au)

/** \brief 549C, Read Data and Bit Flip Register 30 */
#define MTU_MC84_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006649Cu)

/** \brief 549E, Read Data and Bit Flip Register 31 */
#define MTU_MC84_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006649Eu)

/** \brief 54A0, Read Data and Bit Flip Register 32 */
#define MTU_MC84_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664A0u)

/** \brief 54A2, Read Data and Bit Flip Register 33 */
#define MTU_MC84_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664A2u)

/** \brief 54A4, Read Data and Bit Flip Register 34 */
#define MTU_MC84_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664A4u)

/** \brief 54A6, Read Data and Bit Flip Register 35 */
#define MTU_MC84_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664A6u)

/** \brief 54A8, Read Data and Bit Flip Register 36 */
#define MTU_MC84_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664A8u)

/** \brief 54AA, Read Data and Bit Flip Register 37 */
#define MTU_MC84_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664AAu)

/** \brief 54AC, Read Data and Bit Flip Register 38 */
#define MTU_MC84_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664ACu)

/** \brief 54AE, Read Data and Bit Flip Register 39 */
#define MTU_MC84_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664AEu)

/** \brief 54B0, Read Data and Bit Flip Register 40 */
#define MTU_MC84_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664B0u)

/** \brief 54B2, Read Data and Bit Flip Register 41 */
#define MTU_MC84_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664B2u)

/** \brief 54B4, Read Data and Bit Flip Register 42 */
#define MTU_MC84_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664B4u)

/** \brief 54B6, Read Data and Bit Flip Register 43 */
#define MTU_MC84_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664B6u)

/** \brief 54B8, Read Data and Bit Flip Register 44 */
#define MTU_MC84_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664B8u)

/** \brief 54BA, Read Data and Bit Flip Register 45 */
#define MTU_MC84_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664BAu)

/** \brief 54BC, Read Data and Bit Flip Register 46 */
#define MTU_MC84_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664BCu)

/** \brief 54BE, Read Data and Bit Flip Register 47 */
#define MTU_MC84_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664BEu)

/** \brief 54C0, Read Data and Bit Flip Register 48 */
#define MTU_MC84_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664C0u)

/** \brief 54C2, Read Data and Bit Flip Register 49 */
#define MTU_MC84_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664C2u)

/** \brief 54C4, Read Data and Bit Flip Register 50 */
#define MTU_MC84_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664C4u)

/** \brief 54C6, Read Data and Bit Flip Register 51 */
#define MTU_MC84_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664C6u)

/** \brief 54C8, Read Data and Bit Flip Register 52 */
#define MTU_MC84_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664C8u)

/** \brief 54CA, Read Data and Bit Flip Register 53 */
#define MTU_MC84_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00664CAu)

