Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxMtu_reg.h
/** \brief 5678, Read Data and Bit Flip Register 12 */
#define MTU_MC86_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066678u)

/** \brief 567A, Read Data and Bit Flip Register 13 */
#define MTU_MC86_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006667Au)

/** \brief 567C, Read Data and Bit Flip Register 14 */
#define MTU_MC86_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006667Cu)

/** \brief 567E, Read Data and Bit Flip Register 15 */
#define MTU_MC86_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006667Eu)

/** \brief 5680, Read Data and Bit Flip Register 16 */
#define MTU_MC86_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066680u)

/** \brief 5682, Read Data and Bit Flip Register 17 */
#define MTU_MC86_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066682u)

/** \brief 5684, Read Data and Bit Flip Register 18 */
#define MTU_MC86_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066684u)

/** \brief 5686, Read Data and Bit Flip Register 19 */
#define MTU_MC86_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066686u)

/** \brief 5688, Read Data and Bit Flip Register 20 */
#define MTU_MC86_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066688u)

/** \brief 568A, Read Data and Bit Flip Register 21 */
#define MTU_MC86_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006668Au)

/** \brief 568C, Read Data and Bit Flip Register 22 */
#define MTU_MC86_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006668Cu)

/** \brief 568E, Read Data and Bit Flip Register 23 */
#define MTU_MC86_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006668Eu)

/** \brief 5690, Read Data and Bit Flip Register 24 */
#define MTU_MC86_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066690u)

/** \brief 5692, Read Data and Bit Flip Register 25 */
#define MTU_MC86_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066692u)

/** \brief 5694, Read Data and Bit Flip Register 26 */
#define MTU_MC86_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066694u)

/** \brief 5696, Read Data and Bit Flip Register 27 */
#define MTU_MC86_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066696u)

/** \brief 5698, Read Data and Bit Flip Register 28 */
#define MTU_MC86_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066698u)

/** \brief 569A, Read Data and Bit Flip Register 29 */
#define MTU_MC86_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006669Au)

/** \brief 569C, Read Data and Bit Flip Register 30 */
#define MTU_MC86_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006669Cu)

/** \brief 569E, Read Data and Bit Flip Register 31 */
#define MTU_MC86_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006669Eu)

/** \brief 56A0, Read Data and Bit Flip Register 32 */
#define MTU_MC86_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A0u)

/** \brief 56A2, Read Data and Bit Flip Register 33 */
#define MTU_MC86_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A2u)

/** \brief 56A4, Read Data and Bit Flip Register 34 */
#define MTU_MC86_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A4u)

/** \brief 56A6, Read Data and Bit Flip Register 35 */
#define MTU_MC86_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A6u)

/** \brief 56A8, Read Data and Bit Flip Register 36 */
#define MTU_MC86_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666A8u)

/** \brief 56AA, Read Data and Bit Flip Register 37 */
#define MTU_MC86_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666AAu)

/** \brief 56AC, Read Data and Bit Flip Register 38 */
#define MTU_MC86_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666ACu)

/** \brief 56AE, Read Data and Bit Flip Register 39 */
#define MTU_MC86_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666AEu)

/** \brief 56B0, Read Data and Bit Flip Register 40 */
#define MTU_MC86_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B0u)

/** \brief 56B2, Read Data and Bit Flip Register 41 */
#define MTU_MC86_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B2u)

/** \brief 56B4, Read Data and Bit Flip Register 42 */
#define MTU_MC86_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B4u)

/** \brief 56B6, Read Data and Bit Flip Register 43 */
#define MTU_MC86_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B6u)

/** \brief 56B8, Read Data and Bit Flip Register 44 */
#define MTU_MC86_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666B8u)

/** \brief 56BA, Read Data and Bit Flip Register 45 */
#define MTU_MC86_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666BAu)

/** \brief 56BC, Read Data and Bit Flip Register 46 */
#define MTU_MC86_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666BCu)

/** \brief 56BE, Read Data and Bit Flip Register 47 */
#define MTU_MC86_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666BEu)

/** \brief 56C0, Read Data and Bit Flip Register 48 */
#define MTU_MC86_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C0u)

/** \brief 56C2, Read Data and Bit Flip Register 49 */
#define MTU_MC86_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C2u)

/** \brief 56C4, Read Data and Bit Flip Register 50 */
#define MTU_MC86_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C4u)

/** \brief 56C6, Read Data and Bit Flip Register 51 */
#define MTU_MC86_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C6u)

/** \brief 56C8, Read Data and Bit Flip Register 52 */
#define MTU_MC86_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666C8u)

/** \brief 56CA, Read Data and Bit Flip Register 53 */
#define MTU_MC86_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666CAu)

/** \brief 56CC, Read Data and Bit Flip Register 54 */
#define MTU_MC86_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00666CCu)

